{"84729": {"Nombre": "Versión de sistema operativo Microsoft Windows Server 2003", "Sinopsis": "El sistema operativo remoto ya no es soportado por el fabricante.", "Explotación": "No existen exploits conocidos para la versión.", "Categoría": "Vulnerabilidad", "Descripción": "El host remoto ejecuta Microsoft Windows Server 2003. El soporte para este sistema operativo de Microsoft finalizó el 14 de julio de 2015. La falta de soporte implica que el proveedor no lanzará nuevos parches de seguridad para el producto. Como resultado, es probable que contenga vulnerabilidades de seguridad. Además, es poco probable que Microsoft investigue o reconozca los informes de vulnerabilidades.", "Recomendación": "Actualizar a una versión de Windows que actualmente sea soportada por el proveedor.", "Impacto": "Dado que la versión ya no tiene soporte, pueden existir múltiples vulnerabilidades, que implican un riesgo crítico para la empresa ya que la explotación de estas vulnerabilidades podría permitirle a un atacante el dominio total del equipo.", "Esfuerzo": "Difícil"}, "97994": {"Nombre": "Versión de servidor web Microsoft IIS 6.0", "Sinopsis": "Se está ejecutando una versión no compatible de Microsoft IIS en el host remoto.", "Explotación": "No existen exploits disponibles abiertamente para la versión.", "Categoría": "Vulnerabilidad", "Descripción": "La versión  de Microsoft Internet Information Services (IIS) 6.0 no posee soporte lo que implica que el proveedor no lanzará nuevos parches de seguridad para el producto. Como resultado, es probable que contenga vulnerabilidades de seguridad.", "Recomendación": "Actualizar a una versión de IIS que actualmente sea soportada por el proveedor.", "Impacto": "Dado que la versión ya no tiene soporte, existen múltiples vulnerabilidades conocidas, que implican un riesgo crítico para la empresa ya que la explotación de estas vulnerabilidades podría permitirle a un atacante generar una denegación de servicio.", "Esfuerzo": "Difícil"}, "10882": {"Nombre": "Protocolo SSH versión 1", "Sinopsis": "El servicio remoto ofrece un protocolo criptográfico inseguro.", "Explotación": "No existen exploits disponibles abiertamente para la versión.", "Categoría": "Configuración", "Descripción": "El servicio SSH remoto admite conexiones realizadas con la versión 1.33 y / o 1.5 del protocolo SSH. Estos protocolos no son completamente seguros desde el punto de vista criptográfico, por lo que no deben utilizarse.", "Recomendación": "Desactivar la compatibilidad con la versión 1 del protocolo.", "Impacto": "Existen vulnerabilidades conocidas que implican un riesgo alto para la empresa ya que la explotación de estas vulnerabilidades podría permitirle a un atacante el robo de información, contraseñas y autentificación no autorizada.", "Esfuerzo": "Fácil"}, "42873": {"Nombre": "Protocolo SSL admite suites de cifrado débiles ", "Sinopsis": "El servicio remoto admite el uso de cifrados SSL débiles.", "Explotación": "La explotación de esta vulnerabilidad requiere la captura de tráfico legítimo de los usuarios en la misma red.", "Categoría": "Configuración", "Descripción": "El host remoto admite el uso de cifrados SSL de intensidad media, es decir, que usan longitudes de clave de al menos 64 bits y menos de 112 bits, o bien que use el conjunto de cifrado 3DES. Además es compatible con el uso de RC4 en uno o más conjuntos de cifrado. El cifrado RC4 es defectuoso en su generación de un flujo de bytes pseudoaleatorios. ", "Recomendación": "Reconfigure la aplicación afectada si es posible para evitar el uso de cifrados débiles. ", "Impacto": "Por estas vulnerabilidades, si un atacante puede obtener muchos textos cifrados de estos modos, el atacante puede derivar el texto simple, obteniendo toda la información que estos contienen. Es considerablemente más fácil evitar el cifrado si el atacante está en la misma red física. Los cifrados anónimos no ofrecen ninguna forma de verificar la identidad del host remoto y hace que el servicio sea vulnerable a un ataque de hombre en el medio.", "Esfuerzo": "Fácil"}, "57582": {"Nombre": "Certificado SSL autofirmado", "Sinopsis": "La cadena de certificados SSL para este servicio termina en un certificado autofirmado no reconocido.", "Explotación": "La prueba de concepto de esta vulnerabilidad implica la realización de un ataque del tipo man in the middle.", "Categoría": "Configuración", "Descripción": "La cadena de certificados X.509 para este servicio no está firmada por una autoridad de certificados reconocida. ", "Recomendación": "Compre o genere un certificado adecuado para este servicio.", "Impacto": "Si el host remoto es un host público en producción, esto anula el uso de SSL, ya que cualquiera podría establecer un ataque de hombre en el medio contra el host remoto.", "Esfuerzo": "Medio"}, "42263": {"Nombre": "Servidor Telnet sin cifrar", "Sinopsis": "El servidor remoto de Telnet transmite el tráfico en texto plano.", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Vulnerabilidad", "Descripción": "El host remoto ejecuta un servidor Telnet en un canal no cifrado. No se recomienda utilizar Telnet a través de un canal no cifrado, ya que los inicios de sesión, las contraseñas y los comandos se transfieren en texto sin cifrar. ", "Recomendación": "Deshabilite el servicio Telnet y use SSH en su lugar. Se prefiere SSH a Telnet, ya que protege las credenciales de las escuchas ilegales y puede canalizar flujos de datos adicionales, como una sesión X11.", "Impacto": "La transferencia de texto sin cifrar, le puede permitir a un atacante remoto, hombre en el medio, escuchar a escondidas en una sesión de Telnet para obtener credenciales u otra información confidencial y modificar el tráfico intercambiado entre un cliente y un servidor. ", "Esfuerzo": "Fácil"}, "62694": {"Nombre": "Servicio IKE con modo agresivo activado ", "Sinopsis": "El servicio Internet Key Exchange IKEv1 remoto admite el modo agresivo con clave precompartida.", "Explotación": "No existen exploits disponibles públicamente para esta vulnerabilidad.", "Categoría": "Configuración", "Descripción": "El servicio remoto de intercambio de claves de Internet (IKE) versión 1 parece admitir el modo agresivo con autenticación de clave precompartida (PSK). ", "Recomendación": "Deshabilite el modo agresivo si es compatible. No use la clave precompartida para la autenticación si es posible. Si no puede evitar usar la clave precompartida, use claves muy fuertes. Si es posible, no permita conexiones VPN solo desde ciertas direcciones IP.", "Impacto": "Esta configuración podría permitir a un atacante capturar y descifrar la PSK de un servicio VPN y obtener acceso no autorizado a redes privadas.", "Esfuerzo": "Fácil"}, "18405": {"Nombre": "El protocolo de Microsoft Windows Remote Desktop es vulnerable a ataques Man In The Middle", "Sinopsis": "La versión remota del Remote Desktop Protocol Server (Servicio de terminal) es vulnerable a un ataque de hombre en el medio (MiTM).", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Vulnerabilidad", "Descripción": "La versión protocolo Microsoft Windows Remote Desktop (Servicio de terminal) es vulnerable a un ataque de hombre en el medio (MiTM). El cliente RDP no hace ningún esfuerzo para validar la identidad del servidor al configurar el cifrado. Un atacante con la capacidad de interceptar el tráfico del servidor RDP puede establecer el cifrado con el cliente y el servidor sin ser detectado. Esta falla existe porque el servidor RDP almacena una clave privada RSA en la biblioteca mstlsapi.dll. Cualquier usuario local con acceso a este archivo (en cualquier sistema Windows) puede recuperar la clave y usarla para este ataque. Además el cliente RDP no está configurado para usar criptografía segura.", "Recomendación": "Forzar el uso de SSL como capa de transporte para este servicio si es compatible, Seleccione la opción 'Permitir conexiones solo desde computadoras que ejecutan escritorio remoto con autenticación de nivel de red' si está disponible, Cambie el nivel de cifrado RDP a Compatible con FIPS.", "Impacto": "Un ataque MiTM de esta naturaleza permitiría al atacante obtener cualquier información confidencial transmitida, incluidas las credenciales de autenticación. El uso de la criptografía débil con este servicio puede permitir que un atacante escuche las comunicaciones más fácilmente y obtenga capturas de pantalla y / o pulsaciones de teclas.", "Esfuerzo": "Fácil"}, "35450": {"Nombre": "Servidor DNS vulnerable a Amplificación DDoS", "Sinopsis": "El servidor DNS remoto podría usarse en un ataque de denegación de servicio distribuido.", "Explotación": "No se realzan pruebas de denegación de servicio durante las pruebas", "Categoría": "Configuración", "Descripción": "El servidor DNS remoto responde a cualquier solicitud. Es posible consultar los name servers (NS) de la zona raíz ('.') y obtener una respuesta que sea mayor que la solicitud original, lo que es llamado amplificación.", "Recomendación": "Restrinja el acceso a su servidor DNS desde la red pública o reconfigure para rechazar tales consultas.", "Impacto": "Al falsificar la dirección IP de origen, un atacante remoto puede aprovechar esta 'amplificación' para lanzar un ataque de denegación de servicio contra un host de terceros utilizando el servidor DNS remoto.", "Esfuerzo": "Fácil"}, "12217": {"Nombre": "Servidor DNS admite consultas recursivas", "Sinopsis": "El servidor DNS permite que el host realice consultas recursivas, provocando “Divulgación de información remota de caché”  y “Debilidad de envenenamiento de caché”.", "Explotación": "", "Categoría": "Configuración", "Descripción": "El servidor DNS remoto responde a las consultas de dominios de terceros que no tienen establecido el bit de recursión, permitiendo estas consultas de manera recursiva a través de UDP.Esto puede permitir a un atacante remoto determinar qué dominios se han resuelto recientemente a través de este servidor de nombres y, por lo tanto, qué hosts se han visitado recientemente; lo que es conocido como “Divulgación de información remota de caché”. Esto también permite a los atacantes realizar ataques de “envenenamiento de caché” contra este servidor de nombres. ", "Recomendación": "Restrinja las consultas recursivas a los hosts que deberían usar este servidor de nombres (como los de la LAN conectada a él).  Si está utilizando bind 8, puede hacerlo usando la instrucción 'allow-recursion' en la sección de 'opciones' de su named.conf. Si está utilizando bind 9, puede definir una agrupación de direcciones internas usando el comando 'acl'. Luego, dentro del bloque de opciones, puede indicar explícitamente: 'allow-recursion {hosts_defined_in_acl}'. Si está usando otro servidor de nombres, consulte su documentación.", "Impacto": "Mediante la “Divulgación de información remota de caché”, por ejemplo, si un atacante estaba interesado en saber si su compañía utiliza los servicios en línea de una institución financiera en particular, podría usar este ataque para construir un modelo estadístico sobre el uso de la compañía en esa institución financiera. Por supuesto, el ataque también se puede usar para encontrar socios B2B, patrones de navegación web, servidores de correo externos y más. Esto puede incluir empleados, consultores y usuarios potenciales en una red de invitado o conexión WiFi si es compatible. Mediante el “envenenamiento de caché” contra este servidor de nombres se puede se puede usar el host DNS para “rebotar” los ataques de Denegación de Servicio contra otra red o sistema.", "Esfuerzo": "Medio"}, "90317": {"Nombre": "Servicio SSH compatible con algoritmos débiles ", "Sinopsis": "El servidor SSH remoto está configurado para permitir algoritmos de cifrado débiles.", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Configuración", "Descripción": "El servidor SSH remoto está configurado para usar el cifrado de flujo de Arcfour. ", "Recomendación": "Póngase en contacto con el proveedor o consulte la documentación del producto para eliminar los cifrados débiles.", "Impacto": "Se desaconseja el uso de Arcfour debido que el algoritmo genera claves débiles, fácilmente desencriptables.", "Esfuerzo": "Medio"}, "70658": {"Nombre": "Servicio SSH con cifrados en modo CBC habilitados", "Sinopsis": "El servidor SSH está configurado para usar Cipher Block Chaining.", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Configuración", "Descripción": "El servidor SSH está configurado para admitir el cifrado de encadenamiento de bloques de cifrado (CBC). ", "Recomendación": "Deshabilite el cifrado en modo CBC y habilite el cifrado CTR o GCM.", "Impacto": "El uso de CBC puede permitir que un atacante recupere el mensaje de texto plano del texto cifrado, rompiendo con la encriptación.", "Esfuerzo": "Fácil"}, "71049": {"Nombre": "Servicio SSH con cifrados MAC débiles habilitados", "Sinopsis": "El servidor SSH remoto está configurado para permitir algoritmos MAC de MD5 y 96 bits.", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Configuración", "Descripción": "El servidor SSH remoto está configurado para permitir algoritmos MAC MD5 o de 96 bits, ambos se consideran débiles.", "Recomendación": "Póngase en contacto con el proveedor o consulte la documentación del producto para deshabilitar los algoritmos MAC MD5 y 96 bits.", "Impacto": "El uso de estos cifrados puede permitir que un atacante recupere el mensaje de texto plano del texto cifrado, rompiendo con la encriptación.", "Esfuerzo": "Fácil"}, "83875": {"Nombre": "TLS con módulo Diffie-Hellman de 1024 bits", "Sinopsis": "El host remoto permite conexiones TLS con uno módulo Diffie-Hellman de 1024 bits.", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Configuración", "Descripción": "El host remoto permite conexiones TLS con un módulo Diffie-Hellman de 1024 bits. A través del análisis criptográfico, un tercero puede encontrar el secreto compartido en un corto período de tiempo (dependiendo del tamaño del módulo y los recursos del atacante). ", "Recomendación": "Reconfigure el servicio para usar un módulo Diffie-Hellman de 2048 bits o más.", "Impacto": "Esta configuración puede permitir a un atacante recuperar el texto sin cifrar o potencialmente violar la integridad de las conexiones.", "Esfuerzo": "Fácil"}, "15855": {"Nombre": "Servicio POP3 con inicios de sesión sin cifrar", "Sinopsis": "El demonio POP3 remoto permite que las credenciales se transmitan en texto plano.", "Explotación": "Se establece conexión con el servicio vía telnet y se intenta ingresar con un user y pass de prueba. Utilizando Wireshark, podemos intersectar todos los paquetes enviados y recibidos en una red. Podemos intersectar los paquetes enviados por hacía este servicio y vemos en la información se envió en texto plano.", "Categoría": "Configuración", "Descripción": "El host remoto está ejecutando un demonio POP3 que permite inicios de sesión de texto plano en conexiones no cifradas.", "Recomendación": "Deshabilitar el método de autenticación PLAINTEXT en el servicio.", "Impacto": "Un atacante puede descubrir nombres de usuario y contraseñas escuchando el tráfico al demonio POP3.", "Esfuerzo": "Medio"}, "26194": {"Nombre": "Servidor web transmite credenciales sin cifrar", "Sinopsis": "El servidor web remoto puede transmitir credenciales en texto sin cifrar.", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Configuración", "Descripción": "El servidor web remoto utiliza un servicio HTTP, por lo que los mensajes no se encuentran cifrados. ", "Recomendación": "Asegúrese de que cada formulario sensible transmita contenido a través de HTTPS.", "Impacto": "Un atacante espiando el tráfico entre el navegador web y el servidor puede obtener inicios de sesión y contraseñas de usuarios válidos.", "Esfuerzo": "Medio"}, "10759": {"Nombre": "Divulgación de IP interna del encabezado HTTP del servidor web", "Sinopsis": "Este servidor web divulga una dirección IP privada a través de sus encabezados HTTP.", "Explotación": "https-internal-ip-disclouse de nmap", "Categoría": "Configuración", "Descripción": "Esto puede exponer las direcciones IP internas que generalmente están ocultas o enmascaradas detrás de un servidor de seguridad o servidor proxy de traducción de direcciones de red (NAT). Esto puede afectar a servidores web, aplicaciones web, proxies web, balanceadores de carga, etc. a través de una variedad de configuraciones erróneas relacionadas con la redirección.", "Recomendación": "Configurar el encabezado para que no revele esta información o reemplazar el servicio por uno que no revele información.", "Impacto": "Un atacante con información sobre los rangos internos podría bajo ciertas circunstancias planificar ataques avanzados como IP Spoofing.", "Esfuerzo": "Fácil"}, "69551": {"Nombre": "Certificado SSL contiene claves RSA de menos de 2048 bits", "Sinopsis": "La cadena de certificados X.509 utilizada por este servicio contiene certificados con claves RSA de menos de 2048 bits.", "Explotación": "La explotación requiere la conexión de un usuario valido desde la misma red atacante", "Categoría": "Configuración", "Descripción": "Al menos uno de los certificados X.509 enviados por el host remoto tiene una clave que es más corta que 2048 bits. De acuerdo con los estándares de la industria establecidos por el Certification Authority/Browser (CA/B) Forum, los certificados emitidos después del 1 de enero de 2014 deben ser de al menos 2048 bits. ", "Recomendación": "Reemplace el certificado en la cadena con la clave RSA de menos de 2048 bits de longitud con una clave más larga y vuelva a emitir los certificados firmados por el certificado anterior.", "Impacto": "Algunas implementaciones de SSL del navegador pueden rechazar claves de menos de 2048 bits después del 1 de enero de 2014. Además, algunos proveedores de certificados de SSL pueden revocar certificados de menos de 2048 bits antes del 1 de enero de 2014.", "Esfuerzo": "Fácil"}}